In [1]:
# Import the necessary libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn

### **PHASE 1**

In [2]:
# 1.1 Load Dataset
url = r'https://raw.githubusercontent.com/ek-chris/Practice_datasets/refs/heads/main/EasyVisa%20(1).csv'

In [3]:
#1.2 Load the dataset into Dataframe
easy_visa = pd.read_csv(url)

In [4]:
# Making a copy of the dataset to avoid tampering with the original one
data = easy_visa.copy()

In [5]:
df = pd.DataFrame(data)

In [6]:
#1.3 Inspect the dataset for missing values and handle them appropriately
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [7]:
df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [8]:
df.set_index('case_id', inplace=True)

In [9]:
df.head()

,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
case_id,,,,,,,,,,,
EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [10]:
df.shape

(25480, 11)

In [11]:
df.isnull().sum()

continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [12]:
df.dtypes

continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [13]:
df['yr_of_estab'].unique()

array([2007, 2002, 2008, 1897, 2005, 2012, 1994, 1924, 1995, 2004, 1963,
       2006, 1987, 1991, 2001, 1972, 2013, 1968, 1884, 1981, 1997, 2009,
       1998, 1880, 2000, 2010, 1965, 1909, 2011, 1989, 1933, 1960, 2003,
       1976, 1996, 1847, 1935, 1890, 1999, 1838, 1947, 1939, 1970, 1977,
       1982, 1943, 1956, 1864, 1974, 1985, 1984, 1971, 1913, 1969, 1818,
       1839, 1914, 1988, 1944, 1855, 1975, 1966, 1801, 1920, 1925, 1993,
       1992, 1979, 1986, 1931, 1962, 1954, 1868, 1859, 1946, 1950, 1869,
       1917, 2014, 1980, 1896, 1949, 1843, 1850, 1906, 1961, 1951, 1958,
       1912, 1983, 1948, 1945, 1978, 1898, 1923, 1911, 1851, 1865, 1849,
       1872, 1967, 1926, 1873, 1848, 2015, 1889, 1876, 1852, 1938, 1973,
       1959, 1927, 1990, 1930, 1922, 1940, 1878, 1934, 1834, 1928, 1800,
       1861, 1952, 1846, 1885, 1907, 1817, 1841, 1821, 1953, 1888, 1916,
       1886, 2016, 1932, 1915, 1937, 1866, 1919, 1921, 1910, 1854, 1875,
       1904, 1879, 1942, 1964, 1899, 1900, 1837, 1887, 1929, 1936, 1857,
       1877, 1918, 1902, 1804, 1823, 1893, 1908, 1833, 1941, 1867, 1836,
       1871, 1881, 1840, 1957, 1856, 1845, 1863, 1955, 1858, 1874, 1892,
       1853, 1894, 1883, 1860, 1819, 1905, 1831, 1882, 1870, 1901, 1895,
       1824, 1862, 1807, 1832, 1822, 1903, 1810, 1820, 1809, 1891, 1830,
       1842])

In [14]:
df['prevailing_wage'].unique()

array([   592.2029,  83425.65  , 122996.86  , ..., 146298.85  ,
        86154.77  ,  70876.91  ], shape=(25454,))

In [15]:
df['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25480 entries, EZYV01 to EZYV25480
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   continent              25480 non-null  object
 1   education_of_employee  25480 non-null  object
 2   has_job_experience     25480 non-null  object
 3   requires_job_training  25480 non-null  object
 4   no_of_employees        25480 non-null  int64
 5   yr_of_estab            25480 non-null  int64
 6   region_of_employment   25480 non-null  object
 7   prevailing_wage        25480 non-null  float64
 8   unit_of_wage           25480 non-null  object
 9   full_time_position     25480 non-null  object
 10  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(8)
memory usage: 2.3+ MB

In [17]:
df.duplicated().sum()

np.int64(0)

In [18]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
no_of_employees,25480.0,5667.043210,22877.928848,-26.0000,1022.00,2109.00,3504.0000,602069.00
yr_of_estab,25480.0,1979.409929,42.366929,1800.0000,1976.00,1997.00,2005.0000,2016.00
prevailing_wage,25480.0,74455.814592,52815.942327,2.1367,34015.48,70308.21,107735.5125,319210.27

**From the analysis done, we can see that the data is clean and is ready for Exploratory Data Analysis.**

In [19]:
# Saving the data for EDA purpose
df.to_csv('easy_visa_data.csv')